{


  "sleepneed": "Sleep Need (Server)",
  "sleepneed_sync": "Sleep Need (Synced)",
  "sleepneed_client": "Sleep Need (Client)",
  "playerinfo-sleepiness": "Sleepiness",
  "playerinfo-energy": "Energy",
  "playerinfo-energy-boost": "Invigorated",
  "blockhelp-close": "Close",
  "blockhelp-open": "Open",
  
  "energyguide-title": "Survival Mechanic: Energy & Sleep",
  "energyguide-text": "<strong>Survival Guide</strong><br><i>Energy & Sleep Management</i><br><br>Note: This mod aims to implement an enhanced survival experience complimenting the already in-depth survival aspect of the game.<br>There are changes to how hunger, health and nutrition behaves. The mod is highly configurable with the config file, where you can disable most of these changes and modify almost all variables. You can find instructions on what the config values mean in the Config-Instructions.txt file in the mod folder.<br><br><strong>Sleepiness</strong><br>You now have a fundamental need for sleep.<br>The need for sleep is monitored by the new variable <i>sleepiness</i> which have it's own HUD bar.<br>You gain sleepiness as time goes, feeling refreshed the first couple of hours of the day, but it will start to be a problem when your bar is full and you have reached an overloaded state.<br>This overloaded sleepiness state rapidly reduces ranged weapon accuracy simulating drowsiness. It also drastically increases the energy rate, leading to the next variable implemented by this mod.<br>Vintage story already has a tiredness value determining when the player can sleep. Tiredness and sleepiness is 2 seperate factors, simulating that you can have a bad night of sleep not fully being refreshed and energised, but you are not tired anymore, you are just feeling sleepy and low on energy. This will especially be relevant if you don't keep a good sleep hygiene. You can get behind on sleep and not being able to recover fully if you don't go to bed earlier and are carefull with how much energy you use the next day.<br>There are 3 different tiers of beds in the game providing different lengths of sleep sessions, meaning a better bed replenishes more energy and drains more sleepiness, which encourages the player to upgrade their bed.<br><i>If Energy is disabled by the config file then the overloaded sleepiness state reduces walk speed, ranged weapon accuracy and ranged weapon attack speed simulating drowsiness. All these stats are by default handled by the energy system.</i><br><br><strong>Energy</strong><br>Energy also has it's own HUD bar and is reduced by actions, meaning walking, sprinting, jumping and general work with or without tools. <i>An axe or pickaxe consume more energy than a knife or chisel.</i><br>Sitting down is counted as relaxation and slowly regenerates energy encouraging the player to take a brake to eat, make tools or sorting the storage if energy gets low.<br>The only truly effective way to replenish energy though, is to have a good night's sleep.<br>Energy consumption is governed by an energy rate which increases drastically by being overloaded on sleepiness, being too hot or too cold and/or being hungry.<br>When energy is low, all movement is impaired and it may not be possible to even get over the smallest of obstacles.<br>The work speed with tools, ranged weapons and even animal harvesting is affected. You will take more damage when attacked by enemies and also be dealing less damage with weapons. The opposite is true though, when energy is high.<br>Energy also affects the hunger rate, so that when low on energy you get hungry faster.<br><br><strong>Invigoration</strong><br>The last variable implemented is invigoration.<br>When sleeping and sleepiness eventually is drained enough to feel refreshed and energy is sufficiently high, the sleep session doesn't necessarily end and you start to gain invigoration. <i>It is possible to regain invigoration while relaxing by sitting, if sleepiness is low and energy is sufficiently high.</i><br><br>Being invigorated increases the lung capacity, healing effectiveness and energy capacity. It reduces energy rate and gives a small amount of health points. The boost effect of invigoration is determined by the players health and nutrition status.<br>Invigoration is fragile. This means that if the player takes damage, is starving or has a very low energy level, invigoration decreases rapidly.<br>If you die, invigoration goes to 0.<br>Healing with remedies also takes a toll on the player and has a cost on energy and invigoration, simulating that you have to recover from your injuries.<br>A mean ratio of invigoration and nutrition factored by the current health is considered as being the overall health state of the player and affects the efficiency of almost everything regarding energy and sleepiness.<br><br><strong>Hunger</strong><br>Starving, meaning the hunger bar is empty, now doesn't kill you directly.<br>When starving the energy rate gets very high and the nutrition scores like fruit, protein and grain will deplete at a very fast rate by actions like energy does.<br>When nutrition and satiety is depleted, you experience famine where every move or action you make can mean life or death, meaning if energy reaches 0 at this point you will rapidly take damage and die.<br>",
  


}